///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	КлиентскиеКлиент.ДействияПриНачалеРаботыСистемыКлиент();
//	ТекстСообщения = СерверныеСервер.ПроверкаВерсииПлатформы();
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = ТекстСообщения;
//		Сообщение.Сообщить();
//	КонецЕсли;
//}}MRG[ <-> ]
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
//{{MRG[ <-> ]
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Отказ = Истина;
//	ТекстПредупреждения = "Завершить работу с программой ?";
//}}MRG[ <-> ]
	// Конец СтандартныеПодсистемы
	
//{{MRG[ <-> ]
КонецПроцедуры
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//КонецПроцедуры
//}}MRG[ <-> ]

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
		
КонецПроцедуры

#КонецОбласти